package com.example.czz.coolquestion.bean;

import java.io.Serializable;
import java.util.List;

/**
 * Created by Administrator on 2017/3/11.
 */

public class ProgrammerNewsCol implements Serializable{

    /**
     * newsCollectList : [{"newscollectid":1,"newscontent":{"newsId":8,"newsTitle":"马云致两会代表会员","newsdescribe":"像治理酒驾那样治理假货","newsdetails":"新浪科技讯 3月7日上午消息，马云今日在微博上发文称，要像治理酒驾那样治理假货。马云称，\r\r\n最近关于打假的讨论越来越热烈，包括一些人大代表的建议议案，这样的讨论很健康。就像五年前\r\r\n，如果没有一场关于酒驾的大讨论，没有经争论形成全社会的共识，就不会有后来的司法成果和社\r\r\n会进步。~近日，全国人大代表、马可波罗瓷砖董事长黄建平称，实体经济不好搞，马云有\u201c功劳\r\r\n\u201d。他表示，在淘宝网店上，劣币驱逐良币现象已越来越严重。淘宝官方对此言论做出了回应。~\r\r\n淘宝官方发表声明称，打假是淘宝的责任，但管理好自己的渠道也要品牌方来承担责任。声明称，\r\r\n淘宝网是百分之一百的实体经济，实体经济搞得好有我们的\u201c功劳\u201d。淘宝在文中呼吁，像打击酒\r\r\n驾一样严打假货。~以下为马云微博全文：~致两会代表委员们：像治理酒驾那样治理假货~这几年\r\r\n我认为最经典的司法进步就是酒驾治理。假如没有\u201c酒驾一律拘留、醉驾一律入刑\u201d的严刑竣法，\r\r\n今天中国要多出多少马路杀手！再看假货，绝大部分制假售假者几乎不承担法律责任，违法成本极\r\r\n低而获利极丰，很难想象假货如何才能打干净！我建议参考酒驾醉驾治理，设想假如销售一件假货\r\r\n拘留七天，制造一件假货入刑，那么我想今天中国的知识产权保护现状、食品药品安全现状，我们\r\r\n国家未来的创新能力一定会发生天翻地覆的变化。~最近关于打假的讨论越来越热烈，包括一些人\r\r\n大代表的建议议案，这样的讨论很健康，每一条意见都有其价值。就像五年前，如果没有一场关于\r\r\n酒驾的大讨论，没有经争论形成全社会的共识，就不会有后来的司法成果和社会进步。~对涉假行\r\r\n为的法律规定，很多国家奉行严刑重典，如美国，初犯10年以上的监禁，重犯20年以上，公司会罚\r\r\n到破产，连携带使用假货的人也会面临拘留，如此才有了今天美国的创新环境。~我国法律规定，\r\r\n制假售假案值5万元以下没有刑事责任；5万元以上的顶多判7年。这是20年前的法律和10多年前的\r\r\n司法解释，严重脱离实际，结果是今天99%的制假售假行为不了了之，200万的案值罚20万，老鼠过\r\r\n街，人人喊打，却无人真打。~公检法部门去年投入了巨大的力量打假，但是因为现有法律法规的\r\r\n滞后和不切实际，眼睁睁看着众多案犯不能绳之以法。以阿里巴巴为例，去年大数据排查4495件线\r\r\n索，截至目前，公安机关得以依据现行法律规定进行刑事打击的只有469件，只占十分之一；我们\r\r\n研究了33例已经判决的案件，80%还判了缓刑；我们也研究了去年工商行政处罚的200例制假贩假案\r\r\n件，平均罚款额不到10万元。这样的局面只会鼓励更多人前赴后继地参与制假售假！~\u201c醉驾入刑\r\r\n\u201d到今天五年多，酒驾醉驾引起的事故大幅减少，大家开始形成拒绝酒驾醉驾的自觉，\u201c醉驾入刑\r\r\n\u201d推动了多大的司法的进步和社会进步！制假售假，本质上是一种\u201c偷窃\u201d行为。对于小偷，自古\r\r\n以来是非曲直分明，但是对于偷知识产权，今天中国仍然缺乏社会共识。~假如改变入刑标准，治\r\r\n理假货的结果肯定会大不一样：社会会形成共识，司法机关有法可依，政府部门杜绝权力寻租；更\r\r\n重要的是这代表了我们国家对知识产权的保护，对创新的决心和真正的行动，代表了我们社会的重\r\r\n大进步！因为假货对中国的伤害，远远不是我们看到的假货本身，而是对创新的伤害、对勤奋诚信\r\r\n之人的伤害，对国家未来的伤害\u2026\u2026~假货之祸，横行中国数十年，特别是在中国农村市场更是触\r\r\n目惊心。今日，阿里巴巴每天如同在\u201c上甘岭\u201d战斗在第一线，尽管艰难，但我们推动自己不断进\r\r\n步，我们已经从网上打到了网下，我们一定会斗争到最后一分钟。但打假很难孤军奋战，凭任何一\r\r\n家公司之力无法根除假货顽疾。目前法律体系的滞后更是对假货行为构不成威慑，也为权力寻租留\r\r\n出了巨大空间，而治理假货，需要全社会的合力、需要各方的协同，更需要法治的完善的基石，法\r\r\n治打假，行政打假，平台打假，消费者打假，谁都不应该置身事外。~今天，现实世界里的假货源\r\r\n源不断地从黑工厂中产出，像雾霾一样四面八方袭来，充斥在大街小巷。互联网首当其冲，网络平\r\r\n台当然应该识别、报警、拦截，但是如果不关掉黑工厂，治理污染源，雾霾永远不会消失，这道理\r\r\n明白而简单。阿里巴巴绝不会置身事外，但法律基石永远是根，制造工厂永远是源，从根开始，从\r\r\n源着手，才是我们国家从制造大国走向创新大国，从\u201c嘴治\u201d到\u201c法治\u201d的大道。~法律的修改、\r\r\n完善和进步是一件非常专业严肃的事情，也是一个漫长曲折的过程。我们会一直坚持打假，也会一\r\r\n直坚持呼吁、呐喊，为我们自己和孩子们亲手打造一个\u201c天下无假\u201d的时代。","newspic":"image/mayun.jpg","newspublisher":"新浪科技","newspublishtime":"2017-03-10"}}]
     * result : success
     */

    private String result;
    private List<NewsCollectListBean> newsCollectList;

    public String getResult() {
        return result;
    }

    public void setResult(String result) {
        this.result = result;
    }

    public List<NewsCollectListBean> getNewsCollectList() {
        return newsCollectList;
    }

    public void setNewsCollectList(List<NewsCollectListBean> newsCollectList) {
        this.newsCollectList = newsCollectList;
    }

    public static class NewsCollectListBean implements Serializable{
        /**
         * newscollectid : 1
         * newscontent : {"newsId":8,"newsTitle":"马云致两会代表会员","newsdescribe":"像治理酒驾那样治理假货","newsdetails":"新浪科技讯 3月7日上午消息，马云今日在微博上发文称，要像治理酒驾那样治理假货。马云称，\r\r\n最近关于打假的讨论越来越热烈，包括一些人大代表的建议议案，这样的讨论很健康。就像五年前\r\r\n，如果没有一场关于酒驾的大讨论，没有经争论形成全社会的共识，就不会有后来的司法成果和社\r\r\n会进步。~近日，全国人大代表、马可波罗瓷砖董事长黄建平称，实体经济不好搞，马云有\u201c功劳\r\r\n\u201d。他表示，在淘宝网店上，劣币驱逐良币现象已越来越严重。淘宝官方对此言论做出了回应。~\r\r\n淘宝官方发表声明称，打假是淘宝的责任，但管理好自己的渠道也要品牌方来承担责任。声明称，\r\r\n淘宝网是百分之一百的实体经济，实体经济搞得好有我们的\u201c功劳\u201d。淘宝在文中呼吁，像打击酒\r\r\n驾一样严打假货。~以下为马云微博全文：~致两会代表委员们：像治理酒驾那样治理假货~这几年\r\r\n我认为最经典的司法进步就是酒驾治理。假如没有\u201c酒驾一律拘留、醉驾一律入刑\u201d的严刑竣法，\r\r\n今天中国要多出多少马路杀手！再看假货，绝大部分制假售假者几乎不承担法律责任，违法成本极\r\r\n低而获利极丰，很难想象假货如何才能打干净！我建议参考酒驾醉驾治理，设想假如销售一件假货\r\r\n拘留七天，制造一件假货入刑，那么我想今天中国的知识产权保护现状、食品药品安全现状，我们\r\r\n国家未来的创新能力一定会发生天翻地覆的变化。~最近关于打假的讨论越来越热烈，包括一些人\r\r\n大代表的建议议案，这样的讨论很健康，每一条意见都有其价值。就像五年前，如果没有一场关于\r\r\n酒驾的大讨论，没有经争论形成全社会的共识，就不会有后来的司法成果和社会进步。~对涉假行\r\r\n为的法律规定，很多国家奉行严刑重典，如美国，初犯10年以上的监禁，重犯20年以上，公司会罚\r\r\n到破产，连携带使用假货的人也会面临拘留，如此才有了今天美国的创新环境。~我国法律规定，\r\r\n制假售假案值5万元以下没有刑事责任；5万元以上的顶多判7年。这是20年前的法律和10多年前的\r\r\n司法解释，严重脱离实际，结果是今天99%的制假售假行为不了了之，200万的案值罚20万，老鼠过\r\r\n街，人人喊打，却无人真打。~公检法部门去年投入了巨大的力量打假，但是因为现有法律法规的\r\r\n滞后和不切实际，眼睁睁看着众多案犯不能绳之以法。以阿里巴巴为例，去年大数据排查4495件线\r\r\n索，截至目前，公安机关得以依据现行法律规定进行刑事打击的只有469件，只占十分之一；我们\r\r\n研究了33例已经判决的案件，80%还判了缓刑；我们也研究了去年工商行政处罚的200例制假贩假案\r\r\n件，平均罚款额不到10万元。这样的局面只会鼓励更多人前赴后继地参与制假售假！~\u201c醉驾入刑\r\r\n\u201d到今天五年多，酒驾醉驾引起的事故大幅减少，大家开始形成拒绝酒驾醉驾的自觉，\u201c醉驾入刑\r\r\n\u201d推动了多大的司法的进步和社会进步！制假售假，本质上是一种\u201c偷窃\u201d行为。对于小偷，自古\r\r\n以来是非曲直分明，但是对于偷知识产权，今天中国仍然缺乏社会共识。~假如改变入刑标准，治\r\r\n理假货的结果肯定会大不一样：社会会形成共识，司法机关有法可依，政府部门杜绝权力寻租；更\r\r\n重要的是这代表了我们国家对知识产权的保护，对创新的决心和真正的行动，代表了我们社会的重\r\r\n大进步！因为假货对中国的伤害，远远不是我们看到的假货本身，而是对创新的伤害、对勤奋诚信\r\r\n之人的伤害，对国家未来的伤害\u2026\u2026~假货之祸，横行中国数十年，特别是在中国农村市场更是触\r\r\n目惊心。今日，阿里巴巴每天如同在\u201c上甘岭\u201d战斗在第一线，尽管艰难，但我们推动自己不断进\r\r\n步，我们已经从网上打到了网下，我们一定会斗争到最后一分钟。但打假很难孤军奋战，凭任何一\r\r\n家公司之力无法根除假货顽疾。目前法律体系的滞后更是对假货行为构不成威慑，也为权力寻租留\r\r\n出了巨大空间，而治理假货，需要全社会的合力、需要各方的协同，更需要法治的完善的基石，法\r\r\n治打假，行政打假，平台打假，消费者打假，谁都不应该置身事外。~今天，现实世界里的假货源\r\r\n源不断地从黑工厂中产出，像雾霾一样四面八方袭来，充斥在大街小巷。互联网首当其冲，网络平\r\r\n台当然应该识别、报警、拦截，但是如果不关掉黑工厂，治理污染源，雾霾永远不会消失，这道理\r\r\n明白而简单。阿里巴巴绝不会置身事外，但法律基石永远是根，制造工厂永远是源，从根开始，从\r\r\n源着手，才是我们国家从制造大国走向创新大国，从\u201c嘴治\u201d到\u201c法治\u201d的大道。~法律的修改、\r\r\n完善和进步是一件非常专业严肃的事情，也是一个漫长曲折的过程。我们会一直坚持打假，也会一\r\r\n直坚持呼吁、呐喊，为我们自己和孩子们亲手打造一个\u201c天下无假\u201d的时代。","newspic":"image/mayun.jpg","newspublisher":"新浪科技","newspublishtime":"2017-03-10"}
         */

        private int newscollectid;
        private NewscontentBean newscontent;

        public int getNewscollectid() {
            return newscollectid;
        }

        public void setNewscollectid(int newscollectid) {
            this.newscollectid = newscollectid;
        }

        public NewscontentBean getNewscontent() {
            return newscontent;
        }

        public void setNewscontent(NewscontentBean newscontent) {
            this.newscontent = newscontent;
        }

        public static class NewscontentBean implements Serializable{
            /**
             * newsId : 8
             * newsTitle : 马云致两会代表会员
             * newsdescribe : 像治理酒驾那样治理假货
             * newsdetails : 新浪科技讯 3月7日上午消息，马云今日在微博上发文称，要像治理酒驾那样治理假货。马云称，
             最近关于打假的讨论越来越热烈，包括一些人大代表的建议议案，这样的讨论很健康。就像五年前
             ，如果没有一场关于酒驾的大讨论，没有经争论形成全社会的共识，就不会有后来的司法成果和社
             会进步。~近日，全国人大代表、马可波罗瓷砖董事长黄建平称，实体经济不好搞，马云有“功劳
             ”。他表示，在淘宝网店上，劣币驱逐良币现象已越来越严重。淘宝官方对此言论做出了回应。~
             淘宝官方发表声明称，打假是淘宝的责任，但管理好自己的渠道也要品牌方来承担责任。声明称，
             淘宝网是百分之一百的实体经济，实体经济搞得好有我们的“功劳”。淘宝在文中呼吁，像打击酒
             驾一样严打假货。~以下为马云微博全文：~致两会代表委员们：像治理酒驾那样治理假货~这几年
             我认为最经典的司法进步就是酒驾治理。假如没有“酒驾一律拘留、醉驾一律入刑”的严刑竣法，
             今天中国要多出多少马路杀手！再看假货，绝大部分制假售假者几乎不承担法律责任，违法成本极
             低而获利极丰，很难想象假货如何才能打干净！我建议参考酒驾醉驾治理，设想假如销售一件假货
             拘留七天，制造一件假货入刑，那么我想今天中国的知识产权保护现状、食品药品安全现状，我们
             国家未来的创新能力一定会发生天翻地覆的变化。~最近关于打假的讨论越来越热烈，包括一些人
             大代表的建议议案，这样的讨论很健康，每一条意见都有其价值。就像五年前，如果没有一场关于
             酒驾的大讨论，没有经争论形成全社会的共识，就不会有后来的司法成果和社会进步。~对涉假行
             为的法律规定，很多国家奉行严刑重典，如美国，初犯10年以上的监禁，重犯20年以上，公司会罚
             到破产，连携带使用假货的人也会面临拘留，如此才有了今天美国的创新环境。~我国法律规定，
             制假售假案值5万元以下没有刑事责任；5万元以上的顶多判7年。这是20年前的法律和10多年前的
             司法解释，严重脱离实际，结果是今天99%的制假售假行为不了了之，200万的案值罚20万，老鼠过
             街，人人喊打，却无人真打。~公检法部门去年投入了巨大的力量打假，但是因为现有法律法规的
             滞后和不切实际，眼睁睁看着众多案犯不能绳之以法。以阿里巴巴为例，去年大数据排查4495件线
             索，截至目前，公安机关得以依据现行法律规定进行刑事打击的只有469件，只占十分之一；我们
             研究了33例已经判决的案件，80%还判了缓刑；我们也研究了去年工商行政处罚的200例制假贩假案
             件，平均罚款额不到10万元。这样的局面只会鼓励更多人前赴后继地参与制假售假！~“醉驾入刑
             ”到今天五年多，酒驾醉驾引起的事故大幅减少，大家开始形成拒绝酒驾醉驾的自觉，“醉驾入刑
             ”推动了多大的司法的进步和社会进步！制假售假，本质上是一种“偷窃”行为。对于小偷，自古
             以来是非曲直分明，但是对于偷知识产权，今天中国仍然缺乏社会共识。~假如改变入刑标准，治
             理假货的结果肯定会大不一样：社会会形成共识，司法机关有法可依，政府部门杜绝权力寻租；更
             重要的是这代表了我们国家对知识产权的保护，对创新的决心和真正的行动，代表了我们社会的重
             大进步！因为假货对中国的伤害，远远不是我们看到的假货本身，而是对创新的伤害、对勤奋诚信
             之人的伤害，对国家未来的伤害……~假货之祸，横行中国数十年，特别是在中国农村市场更是触
             目惊心。今日，阿里巴巴每天如同在“上甘岭”战斗在第一线，尽管艰难，但我们推动自己不断进
             步，我们已经从网上打到了网下，我们一定会斗争到最后一分钟。但打假很难孤军奋战，凭任何一
             家公司之力无法根除假货顽疾。目前法律体系的滞后更是对假货行为构不成威慑，也为权力寻租留
             出了巨大空间，而治理假货，需要全社会的合力、需要各方的协同，更需要法治的完善的基石，法
             治打假，行政打假，平台打假，消费者打假，谁都不应该置身事外。~今天，现实世界里的假货源
             源不断地从黑工厂中产出，像雾霾一样四面八方袭来，充斥在大街小巷。互联网首当其冲，网络平
             台当然应该识别、报警、拦截，但是如果不关掉黑工厂，治理污染源，雾霾永远不会消失，这道理
             明白而简单。阿里巴巴绝不会置身事外，但法律基石永远是根，制造工厂永远是源，从根开始，从
             源着手，才是我们国家从制造大国走向创新大国，从“嘴治”到“法治”的大道。~法律的修改、
             完善和进步是一件非常专业严肃的事情，也是一个漫长曲折的过程。我们会一直坚持打假，也会一
             直坚持呼吁、呐喊，为我们自己和孩子们亲手打造一个“天下无假”的时代。
             * newspic : image/mayun.jpg
             * newspublisher : 新浪科技
             * newspublishtime : 2017-03-10
             */

            private int newsId;
            private String newsTitle;
            private String newsdescribe;
            private String newsdetails;
            private String newspic;
            private String newspublisher;
            private String newspublishtime;

            public int getNewsId() {
                return newsId;
            }

            public void setNewsId(int newsId) {
                this.newsId = newsId;
            }

            public String getNewsTitle() {
                return newsTitle;
            }

            public void setNewsTitle(String newsTitle) {
                this.newsTitle = newsTitle;
            }

            public String getNewsdescribe() {
                return newsdescribe;
            }

            public void setNewsdescribe(String newsdescribe) {
                this.newsdescribe = newsdescribe;
            }

            public String getNewsdetails() {
                return newsdetails;
            }

            public void setNewsdetails(String newsdetails) {
                this.newsdetails = newsdetails;
            }

            public String getNewspic() {
                return newspic;
            }

            public void setNewspic(String newspic) {
                this.newspic = newspic;
            }

            public String getNewspublisher() {
                return newspublisher;
            }

            public void setNewspublisher(String newspublisher) {
                this.newspublisher = newspublisher;
            }

            public String getNewspublishtime() {
                return newspublishtime;
            }

            public void setNewspublishtime(String newspublishtime) {
                this.newspublishtime = newspublishtime;
            }
        }
    }
}
